import factory


def main():

    # =====================================================
    # Чтение изображений
    # =====================================================
    image_1 = factory.read_image("images/image_1.jpg")
    image_2 = factory.read_image("images/image_2.jpg")

    image_3 = factory.read_image("images/image_3.jpg")
    image_4 = factory.read_image("images/image_4.jpg")

    # =====================================================
    # Отображение цветных изображений и их каналов
    # =====================================================
    factory.show_channels(image_1, "Color Image 1")
    factory.show_channels(image_2, "Color Image 2")

    # =====================================================
    # Отображение черно-белых изображений
    # =====================================================
    factory.show_bw(image_3, "BW Image 3")
    factory.show_bw(image_4, "BW Image 4")

    # =====================================================
    # Бинарные логические операции
    # =====================================================
    factory.logical_operations(image_3, image_4, "Logical Operations")
    factory.logical_operations(image_1, image_2, "Grayscale Logical Operations")

    # =====================================================
    # Унарные логические операции с константой
    # =====================================================
    factory.unary_logical_with_const(image_3, 128)

    # =====================================================
    # Логическое отрицание
    # =====================================================
    factory.show_not(image_1, image_3)

    # =====================================================
    # Сравнение изображения с константой
    # =====================================================
    factory.compare_with_const(image_1, 128)
    factory.compare_with_const(image_2, 128)

    # =====================================================
    # Сравнение двух изображений
    # =====================================================
    factory.compare_images(image_1, image_2)

    # =====================================================
    # Арифметические операции между изображениями
    # =====================================================
    factory.arithmetic_images(image_1, image_2)

    # =====================================================
    # Арифметические операции с константой
    # =====================================================
    factory.arithmetic_const(image_1, 50)

    # =====================================================
    # Деление изображений
    # =====================================================
    factory.divide_images(image_1, image_2)
    factory.divide_images_gray(image_1, image_2)
    # =====================================================
    # Вычисление норм
    # =====================================================
    factory.image_norms(image_1, image_2)


if __name__ == "__main__":
    main()